wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_i2c.h
/**
  * @brief I2C_TXFLR Register Bit Definition
  */
#define I2C_TXFLR_CNT_Pos               (0)
#define I2C_TXFLR_CNT                   (0x03U << I2C_TXFLR_CNT_Pos)            /*!< Number of valid data in the transmit FIFO */

/**
  * @brief I2C_RXFLR Register Bit Definition
  */
#define I2C_RXFLR_CNT_Pos               (0)
#define I2C_RXFLR_CNT                   (0x03U << I2C_RXFLR_CNT_Pos)            /*!< Number of valid data in the receive FIFO */

/**
  * @brief I2C_HOLD Register Bit Definition
  */
#define I2C_HOLD_TX_HOLD_Pos            (0)
#define I2C_HOLD_TX_HOLD                (0xFFFFU << I2C_HOLD_TX_HOLD_Pos)       /*1< SDA hold time when I2C acts as a transmit */
#define I2C_HOLD_RX_HOLD_Pos            (16)
#define I2C_HOLD_RX_HOLD                (0xFFU << I2C_HOLD_RX_HOLD_Pos)         /*1< SDA hold time when I2C acts as a receiver */

/**
  * @brief I2C_DMA Register Bit Definition
  */
#define I2C_DMA_RXEN_Pos                (0)
#define I2C_DMA_RXEN                    (0x01U << I2C_DMA_RXEN_Pos)             /*!< Receive DMA enable */
#define I2C_DMA_TXEN_Pos                (1)
#define I2C_DMA_TXEN                    (0x01U << I2C_DMA_TXEN_Pos)             /*!< Transmit DMA enable */

/**
  * @brief I2C_SETUP Register Bit Definition
  */
#define I2C_SETUP_CNT_Pos               (0)
#define I2C_SETUP_CNT                   (0xFFU << I2C_SETUP_CNT_Pos)            /*!< SDA setup */

/**
  * @brief I2C_GCR Register Bit Definition
  */
#define I2C_GCR_GC_Pos                  (0)
#define I2C_GCR_GC                      (0x01U << I2C_GCR_GC_Pos)               /*!< ACK general call */

#define I2C_SLVMASK_Pos                 (0)
#define I2C_SLVMASK                     (0x3FFU <<I2C_SLVMASK_Pos)

#define I2C_SLVRCVADDR_Pos              (0)
#define I2C_SLVRCVADDR                  (0x3FFU <<I2C_SLVRCVADDR_Pos)

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

/*----------------------------------------------------------------------------*/
#endif
/*----------------------------------------------------------------------------*/
